<a href="https://colab.research.google.com/github/krishbhowmick/EDA/blob/main/Interview1_Games2Win.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## <font color="maroon"><h4 align="center">Games 2 Win</font>

In [ ]:
# Connect the google drive with google Colab

from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [ ]:
import pandas as pd 
df = pd.read_csv("/content/drive/MyDrive/Games2Win/Data Table - For Analytics Assignment - items_bought.csv" )
df.head(5)

                                 id        country  ... item_name iap_price
0  1C91E019A6B349FBA63233528F1F0099  United States  ...    budget      1.99
1  BC3BA5F6D7024DF3AF2E253C66DD954A  United States  ...    budget      1.99
2  A87D86FBF0754DED8A4FF70B6FCCA51F  United States  ...    budget      1.99
3  2A07E2D8F8F14238BC1934D9900D20C0  United States  ...    budget      1.99
4  BB0BE1B3526A459B8C13D1E8B5904042  United States  ...    budget      1.99

[5 rows x 5 columns]

In [ ]:
#Using dictionary
import pandas as pd
citydata = {
    'id': ['A','B','A','C','A','B','D','A','D','C'],
    'city': ['Mum','Mum','Hyd','Del','Kol','Mum','Hyd','Kol','Kol','Mum'],
    'score': [10,7,6,8,8,9,5,9,8,9]
}
q = pd.DataFrame(citydata)
q

  id city  score
0  A  Mum     10
1  B  Mum      7
2  A  Hyd      6
3  C  Del      8
4  A  Kol      8
5  B  Mum      9
6  D  Hyd      5
7  A  Kol      9
8  D  Kol      8
9  C  Mum      9

In [ ]:
q1 = q.groupby(['id','city']).size().to_frame('size')
q1

         size
id city
A  Hyd      1
   Kol      2
   Mum      1
B  Mum      2
C  Del      1
   Mum      1
D  Hyd      1
   Kol      1

In [ ]:
import numpy as np
q2= q[['id','city']]
q2['size'] = q2.groupby(['id']).transform(np.size)
q2

  id city  size
0  A  Mum     4
1  B  Mum     2
2  A  Hyd     4
3  C  Del     2
4  A  Kol     4
5  B  Mum     2
6  D  Hyd     2
7  A  Kol     4
8  D  Kol     2
9  C  Mum     2

In [ ]:
q3=q[['id','city']]
q3 =q3.groupby(['id']).size().reset_index(name='Size')
q3

  id  Size
0  A     4
1  B     2
2  C     2
3  D     2

In [ ]:
q3.mean()

Size    2.5
dtype: float64

In [ ]:
q4=q[['id','score']]
q4= q4.groupby('id').apply(lambda x: x.sort_values(["score"], ascending = False)).reset_index(drop=True)
q4=q4.groupby('id').head(3)
q4

  id  score
0  A     10
1  A      9
2  A      8
4  B      9
5  B      7
6  C      9
7  C      8
8  D      8
9  D      5

In [ ]:
q4=q[['id','city','score']]
q4= q4.groupby(by=['id','city'])['score'].sum().reset_index(name='sum')       #agg({'score':'sum'})
q4= q4.groupby('id').apply(lambda x: x.sort_values(["sum"], ascending = False)).reset_index(drop=True)
q4= q4.groupby('id').head(2)
#q4=q4.groupby(['id'])['sum'].max()
q4

  id city  sum
0  A  Kol   17
1  A  Mum   10
3  B  Mum   16
4  C  Mum    9
5  C  Del    8
6  D  Kol    8
7  D  Hyd    5

In [ ]:
df.columns

Index(['id', 'country', 'date', 'item_name', 'iap_price'], dtype='object')

In [ ]:
#Q1-Total unique users who bought something,  and 
Q1= df[['id']].nunique()
Q1

id    229
dtype: int64

In [ ]:
#Q1.1- how many items did they buy on average
#Q2  - how many items did they buy on average

Q11= df[['id','item_name']]
Q11=Q11.groupby('id').size().reset_index(name='count')
Q11.mean()

count    3.89083
dtype: float64

In [ ]:
#Q1.11- the average price point of each item bought 
#Q3- the average price point of each item bought

Q111=df[['item_name','iap_price']]
Q111=Q111.groupby('item_name').agg({'iap_price':['count','sum', 'mean']})
Q111

           iap_price
               count      sum       mean
item_name
911               14    98.45   7.032143
SUV               10    80.88   8.088000
all_cars          43   673.86  15.671163
bargain           53   177.56   3.350189
best_buy         302  3130.62  10.366291
budget           104   168.37   1.618942
buses             13    31.16   2.396923
concept           15   123.37   8.224667
crazy             13    31.36   2.412308
designer          13    24.76   1.904615
essential         57    52.86   0.927368
everything        65  1326.78  20.412000
hatchback          9    12.70   1.411111
hot_del           86   346.90   4.033721
muscle            12    73.33   6.110833
sedan             11    38.27   3.479091
sports            15   123.04   8.202667
steal             32   125.52   3.922500
trucks            13   110.13   8.471538
vintage           11    34.02   3.092727

In [ ]:
#Q4-Total items sold and the average price point of the items overall.

df.columns

Index(['id', 'country', 'date', 'item_name', 'iap_price'], dtype='object')

In [ ]:
Q4= df[['item_name']]
Q4.count()

item_name    891
dtype: int64

In [ ]:
Q41=df[['item_name','iap_price']]
Q41.agg({'iap_price':['sum','count','mean']})

        iap_price
sum    6783.94000
count   891.00000
mean      7.61385

In [ ]:
#Q5-Top 3 items sold daily and revenue from these Top 3 items daily.

df.columns

Index(['id', 'country', 'date', 'item_name', 'iap_price'], dtype='object')

In [ ]:
Q5=df[[ 'date', 'item_name', 'iap_price']]
Q5= Q5.groupby(by=['date','item_name'])['iap_price'].sum().reset_index(name='sum')       #agg({'score':'sum'})
Q5= Q5.groupby('date').apply(lambda x: x.sort_values(["sum"], ascending = False)).reset_index(drop=True)
Q5=Q5.groupby('date').head(3)   #.reset_index(drop=True)
#q4=q4.groupby(['id'])['sum'].max()
Q5.head(20)

         date   item_name     sum
0    1-Mar-19    best_buy  283.15
1    1-Mar-19  everything  155.88
2    1-Mar-19         SUV   29.97
20  10-Feb-19     hot_del    0.82
21  10-Mar-19    best_buy   63.82
22  10-Mar-19    all_cars   49.98
23  10-Mar-19  everything   31.45
36  11-Mar-19    best_buy  170.75
37  11-Mar-19  everything  159.95
38  11-Mar-19    all_cars   24.99
45  12-Mar-19    best_buy  743.78
46  12-Mar-19  everything   91.23
47  12-Mar-19    all_cars   76.18
63  13-Mar-19  everything   36.13
64  13-Mar-19    best_buy   28.89
65  13-Mar-19      budget   16.72
77  14-Mar-19  everything   30.59
78  14-Mar-19    best_buy    2.80
79  14-Mar-19   essential    0.62
80  16-Feb-19   essential    1.98

In [ ]:
#Q6-Total revenue made from each item broken down by country and day.

Q6=df[['country', 'date', 'item_name', 'iap_price']]
Q6=Q6.groupby([ 'date','country', 'item_name']).sum()
Q6

                                    iap_price
date     country        item_name
1-Mar-19 Brazil         911              0.76
                        all_cars         1.35
                        bargain          2.84
                        best_buy        60.90
                        budget           0.77
...                                       ...
9-Feb-19 United States  budget           1.99
9-Mar-19 Israel         essential        0.99
         United Kingdom 911              0.39
         United States  budget           1.99
                        everything      34.99

[465 rows x 1 columns]